/* 3.1.1 Напиши програм који на основу године рођења особе коју познајеш проверава да ли је та особа рођена у 21.
веку (претпоставити да он почиње 2001. године). Ако јесте, исписати da. */

// let age = 2050;
// if(age >= 2001 && age < 2022){
//     console.log('Yes')
// }

/*Ученик је одличан ако му је просечна оцена бар 4,5. 
Напиши програм који на основу просечне оцене ученика одређује да ли је ученик одличан или није (програм треба да испише odlican или nije odlican). */

// let grades = 4.5;
// if (grades >= 4.5){
//     console.log('Odlican!')
// }
// else{
//     console.log('Nije odlican!')
// }

/* 3.1.4 Налог на друштвеној мрежи могу да направе само деца која у текућој години пуне 12 или више година.Ако се зна која је година текућа и које године су рођени Јаков и Селена,
 написати програм који одређује да ли они могу да направе налог (исписати латиницом име сваког детета које може да направи налог). */

// let year = 2001;
// let selena = 2008;
// let jakov = 2014;

// if(year <= 2010){
//     console.log('Can make an account')
// }
// else{
//     console.log('You are not able to make an account')
// }

/* 3.2.1 Ученик је врлодобар ако му је просечна оцена већа или једнака од 3,5 и строго мања од 4,5. 
Напиши програм који на основу просечне оцене ученика одређује да ли је ученик одличан или није (програм треба да испише vrlodobar или nije vrlodobar). */

// let avarageGrade = 4.50;
// if(avarageGrade >= 3.5 && avarageGrade < 4.5){
//     console.log('Vrlo dobar!')
// }
// else{
//     console.log('Nisi vrlo dobar')
// }
