//4.1.1 Напиши програм који 30 пута исписује Ja vežbam Python.

// for(i = 0; i <= 40; i++){
//     console.log(i,'Im practicing loop')
// }
// ---------------------------------------------------------------------------------------
//  Напиши програм који исписује бројеве од 0 до 99.

// for(i = 0; i <= 99; i++){
//     console.log(i)
// }
// ---------------------------------------------------------------------------------------
// 4.1.4 Напиши програм који исписује 0, 5, 10, 15, 20, …, 95, svaki broj u posebnom redu.

// for(i = 0; i <= 95; i+=5){
//     console.log(i)
// }
// ---------------------------------------------------------------------------------------
//4.1.6 Напиши програм који исписује све парне бројеве друге стотине (102, 104, …, 200), svaki broj u posebnom redu.

// for(i = 102; i <= 200; i+=2){
//     console.log(i)
// }
// ---------------------------------------------------------------------------------------
//4.1.7 Напиши програм који исписује све непарне бројеве треће стотине (201, 203, …, 299).

// for(i = 201; i < 300; i+=2){
//     console.log(i)
// }
// ---------------------------------------------------------------------------------------
//4.1.11 Дат је правилан низ бројева 3, 7, 11, 15, … Напиши програм који исписује првих 100 елемената тог низа.

// for(i = 3; i <= 100; i+=4){
//     console.log(i)
// }
// ---------------------------------------------------------------------------------------